{
  "request_start_time": "Thu Aug 28 14:08:30 2025",
  "filename": "z (1).pdf",
  "steps": [
    {
      "step": "File Save",
      "status": "Success",
      "duration_seconds": "0.12",
      "temp_path": "/tmp/tmp_if109bt.pdf",
      "extracted_text_first_15_pages": "JOHN VERVAEKE , CHRISTOPHER  MASTROPIETRO  \nAND FILIP MISCEVIC\n     A Twenty-First Century CrisisZombies in\nWestern Culture\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nTo access digital resources including:\nblog posts\nvideos\nonline appendices\nand to purchase copies of this book in:\nhardback\npaperback\nebook editions\nGo to:\nhttps://www.openbookpublishers.com/product/602\nOpen Book Publishers is a non-profit independent initiative. \nWe rely on sales and donations to continue publishing  \nhigh-quality academic works.\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nZombies in Western Culture  \nA Twenty-First Century Crisis\nJohn Vervaeke, Christopher Mastropietro,  \nand Filip Miscevic\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nhttps://www.openbookpublishers.com\n© 2017 John Vervaeke, Christopher Mastropietro and Filip Miscevic.\nThis work is licensed under a Creative Commons Attribution 4.0 International license (CC \nBY 4.0). This license allows you to share, copy, distribute and transmit the work; to adapt \nthe work and to make commercial use of the work providing attribution is made to the \nauthors (but not in any way that suggests that they endorse you or your use of the work). \nAttribution should include the following information:\nJohn Vervaeke, Christopher Mastropietro and Filip Miscevic, Zombies in Western Culture : \nA Twenty-First Century Crisis . Cambridge, UK: Open Book Publishers, 2017, http://dx.doi.\norg/10.11647/OBP.0113\nIn order to access detailed and updated information on the license, please visit https://\nwww.openbookpublishers.com/product/602#copyright\nFurther details about CC BY licenses are available at http://creativecommons.org/licenses/\nby/4.0/\nAll external links were active at the time of publication unless otherwise stated and have \nbeen archived via the Internet Archive Wayback Machine at https://archive.org/web\nDigital material and resources associated with this volume are available at https://www.\nopenbookpublishers.com/product/602#resources\nEvery effort has been made to identify and contact copyright holders and any omission or \nerror will be corrected if notification is made to the publisher.\nISBN Paperback: 9781783743285\nISBN Hardback: 9781783743292\nISBN Digital (PDF): 9781783743308\nISBN Digital ebook (epub): 9781783743315\nISBN Digital ebook (mobi): 9781783743322\nDOI: 10.11647/OBP.0113\nCover image: Zombies  (2013), by Benjamin Réthoré. CC BY 2.0, https://www.flickr.com/\nphotos/bnthor/32590607323/in/photostream/\nAll paper used by Open Book Publishers is SFI (Sustainable Forestry Initiative), PEFC \n(Programme for the Endorsement of Forest Certification Schemes) and Forest Stewardship \nCouncil(r)(FSC(r) certified.\nPrinted in the United Kingdom, United States, and Australia  \nby Lightning Source for Open Book Publishers (Cambridge, UK)\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nContents\nAuthors vii\nAcknowledgements viii\n1.A New Zeitgeist 1\n2.A Transition in Metaphors: A Brief History of Monster Zeitgeists 9\n3.The Four Symbols of the Zombie Metaphor 13\n3.1 The First Symbol: The Semiosis of the Zombie 13\n3.2 The Second Symbol: The Name of the Zombie 22\n3.3 The Third Symbol: The Failure of the Metanarrative  24\n3.4 The Fourth Symbol: The Zombie Apocalypse 27\n4.A Worldview in Crisis: The Domicide of Apocalypse 35\n4.1 Grassy Narrows 35\n4.2 Domicide of the Hellenistic Era 40\n5.The Four Horsemen of the Zombie Apocalypse: Converging \nEvidence for a Crisis in Meaning43\n5.1 Death 45\n5.2 Famine 53\n5.3 Pestilence 59\n5.4 War 62\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n6.An Introduction to the Genealogy of the Meaning Crisis 73\n6.1 The Meaning that Was Lost: Three Orders of a Worldview 73\n6.2 How the Meaning Was Lost: The Fall of the Three Orders 77\n7.Conclusion 83\nReferences 87\nIndex 91\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nAuthors\nDr. John Vervaeke  is an Assistant Professor, in the teaching stream. He \nhas been teaching at the University of Toronto since 1994. He currently \nteaches courses in the Psychology Department and the Cognitive \nScience Program. He has won and been nominated for several teaching \nawards including the 2001 Students’ Administrative Council and \nAssociation of Part-time Undergraduate Students Teaching Award for \nthe Humanities, and the 2012 Ranjini Ghosh Excellence in Teaching \nAward. He has published articles on relevance realization, general \nintelligence, mindfulness, metaphor, and wisdom. His abiding passion \nis to address the Meaning Crisis that besets western culture.\nChristopher Mastropietro  has completed a BA in semiotics, philosophy \nand political science at the University of Toronto. He has been working \nwith John Vervaeke since 2012 to formulate and publish a response to \nthe western Meaning Crisis with convergent insights from cognitive \nscience, philosophy and other disciplines. Christopher is interested in \nthe interaction between sacred symbols and wisdom, and the emergence \nof identity within interpersonal relationships.\nFilip Miscevic  is currently a Ph.D. student in the Cognitive Science \nProgram at Indiana University Bloomington, studying under Dr. Olaf \nSporns in the Computational Cognitive Neuroscience Laboratory. \nHe completed a BSc in cognitive science, neuroscience and computer \nscience at the University of Toronto in 2015, where he was a student of \nJohn Vervaeke. He is fascinated by how an understanding of the mind \nwill revolutionize not only our clinical and scientific practices, but our \nsocial and cultural ones as well―and in particular how it will come to \nbear on the Meaning Crisis discussed in this book, for which the zombie \nhas become the flag-bearer.\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nAcknowledgements\nThe authors gratefully acknowledge the contributions of the following \npeople, whose feedback helped to focus and refine the arguments in this \nbook: Sean al-Baroudi, Sara Hansen, Scott Gardiner, Sasa Milic, Kelly \nMudie, Amogh Sahu and Anderson Todd. We also thank Alessandra \nTosi for her excellent feedback and collaboration.\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n1. A New Zeitgeist\n“Not the Black Death, this time; the Gray Life”.\nHuxley 1962: 59\nFig. 1: Prevalence of the use of the word “zombie” from 1920–2008 in \npredominantly English books published in any country.1\nFig. 2: Zombie Walk Mexico  (2011). Photo by Munir Hamdan.2\n1      From Google N-Gram Viewer ( Michel et al. 2011 ).\n2      Flickr, CC BY 2.0, https://bit.ly/2pcvULo\n© 2017 J. Vervaeke, C. Mastropietro, F. Miscevic, CC BY 4.0  https://doi.org/10.11647/OBP.0113.01\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n2 \nZombies in Western Culture\nIn 2001, a very peculiar performance art begins to take place across North \nAmerica. It occurs first in Sacramento, California and again two years \nlater in Toronto, Ontario. By 2008, it starts recurring annually in certain \nurban centers, grows steadily with each passing year, and spreads \nfrom one city to the next. Sometimes it has fewer than 50 participants. \nSometimes it has over 1000. In late 2011, Mexico City boasts a record \nof 9,000. Some gatherings are meticulous and coordinated, others are \nimpromptu. Some participants join in advance, and many decide to \nfollow spontaneously. Before long, the phenomenon begins to spread \naround the globe.\nFig. 3: “I thought that beauty alone would satisfy. But the soul is gone. \nI can’t bear those empty, staring eyes”. Screenshot from the Halperin \nbrothers ’ 1932 film, White Zombie , at 40:11.3\nIt should surprise us that these “walks” have only begun to appear, \nwhen the paradigm for their behavior has existed since the Halperin \nbrothers  produced White Zombie  in 1932. In this film, a young man \nturned voodoo master transforms a young woman into a subordinate, \npale-skinned corpse. Though his motive is initially to gain her love, his \nmagic succeeds only in removing her vitality. This ironic consequence \ncomes to effect change in his intentions, and he repents to her: “I thought \nthat beauty alone would satisfy. But the soul is gone. I can’t bear those \nempty, staring eyes”. It is a mark of how the zombie has developed over \nthe years that the word “beauty” could ever have been used to describe it.\n3                                  A remastered version of the movie is available at https://www.youtube.com/\nwatch?v=lQ0hL4EBC58\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n 3\n1. A New Zeitgeist\nThe outbreak of zombieism is a twentieth century phenomenon, but \nin the twenty-first century it explodes into zeitgeist. Over 600 zombie \nmovies have been made since 1920, but over one half of them have been \nin the last 10 years. Two great waves have lapped onto the shore of \nAmerican cinema since 2000: one around 2001, and then again in 2008.4 \nTwenty-Eight Days Later  comes out in 2002, George Romero ’s Dawn of the \nDead  is remade in 2004, and Zombieland  becomes the highest-grossing \nzombie film to date in 2009. This is quickly overtaken in 2013, first by \nWarm Bodies , and then by the Brad Pitt epic, World War Z .5 By 2015, there \nare three TV series based on zombies: Z Nation  on Netflix, iZombie  on \nCW, and AMC’s breakthrough hit, The Walking Dead .6 The genre has \nalso enjoyed considerable success in the medium of video games, most \nnotably in the highly lauded The Last of Us .7\nClearly, the zombie has transcended the constraints of its own genre. \nWhereas early zombie films closely adhered to horror tropes, more recent \nrenditions have wed themselves to comedy and romance (Zack Snyder  \nreleased the comedic Shaun of the Dead  in 2004 to critical and popular \nacclaim),8 and broken away from melodrama. The zombie has become a \npervasive cultural symbol  that is constantly expanding its reference, not \ncontent to relegate itself to its tradition. As Dele uze and G uattari (1972: \n332) put it “the only modern myth is the myth of zombies”. The zombie \nseems to be a shifting signifier with an unending hermeneutical compass. \nAnd yet its features remain remarkably consistent from one story to the \nnext, and it has represented many varieties of apocalypse  without altering \nits basic nature: consumerism, poverty, hunger, political dystopia and \n4                                                Annalee Newitz (2008), “War and Social Upheaval Cause Spikes in Zombie Movie \nProduction”, i09.com\n5                                Trailers available on YouTube: Twenty-Eight Days Later  at https://www.youtube.com/\nwatch?v=c7ynwAgQlDQ ; Dawn of the Dead  at https://www.youtube.com/watch?v=-\n-IIwV_Y6VU ; Zombieland  at https://www.youtube.com/watch?v=8m9EVP8X7N8 ; \nWarm Bodies  at https://www.youtube.com/watch?v=yvjwKqA2_9U ; World War Z  \nat https://www.youtube.com/watch?v=HcwTxRuq-uk\n6                Trailers are available on YouTube: Z Nation  at https://www.youtube.com/\nwatch?v=7ZFIS2AqAz8 ; iZombie  (Season 1) at https://www.youtube.com/\nwatch?v=UndyIFo_jZ4 ; The Walking Dead  (Season 1) at https://www.youtube.com/\nwatch?v=sfAc2U20uyg\n7                The trailer of The Last of Us  is available on YouTube at https://www.youtube.com/\nwatch?v=OQWD5W3fpPM\n8                The trailer of Shaun of the Dead  is available on YouTube at https://www.youtube.\ncom/watch?v=LIfcaZ4pC-4\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n4 \nZombies in Western Culture\nenvironmental degradation, zombies have assumed a heterogeneity of \nugliness. No longer simply a vehicle for entertainment, it has become \nthe basis for critical reflection and cultural self-examination, to which an \nincreasing number of academic publications on t he subject atte st (Goto-\nJones  2015; Moreman 2010; We bb and Byrnand 2008). For instance, \nTelevision Ontario devoted an episode of The Agenda with Steve Paikin  \nin 2011 to an unreserved examination of humanity’s most nauseating \nadversary. Four panelists―Daniel Drezner , Arnold T. Blumberg , Robert \nSmith  and Andrew Watson ―sat down to parse its menaces and flesh out \nits metaphors. Zombies have pressed us with the dangers of a unique \nmoment in time, and they have become the most enduring, expressive \nand consummate metaphor for our crisis in meaning.\nThe zombie has been subject to a vast variety of interpretations by \nculture theorists and academics. To examine these exhaustively would \nbe beyond the scope of this or any other monograph. The affinity \nbetween zombies and states of human decrepitude has permitted the \nview that zombies can stand for nearly every conceivable human failing. \nThe present authors propose that the interpretations most favoured by \nacademics―mortality, consumerism and environmental degradation \namong them―are plausible without being sufficient. The mere fact that \neach seems to apply invalidates the proposition that any one of them can \napply exclusively. We take the position that this exegetic pigeonholing \noften falls deftly into the “forest for the trees” category of thinking. The \nzombie zeitgeist accommodates interpretations of disquiet about many \ntopics, yet we will argue that each of these readings should be understood \nas elements of a broader symptomatology. This symptomatology, we \nwill explain, relates to a condition that is far more complex than has \nbeen supposed by any theorist that has previously written on this topic.\nWe propose that the cultural phenomenon of the zombie has provided \nus with a constellation of four intersecting symbols for a modern \nhuman ethos, and that these symbols represent a crisis of worldview  \nthat has no precedent in modern western civilization. Our use of the \ncollective pronoun “we” shall be in broad reference to North-American \nand Western culture more generally. This limitation notwithstanding, \nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n 5\n1. A New Zeitgeist\nthe authors will make no claims regarding the applicability of these \narguments to cultures that may fall outside of that moniker.9\nIn this book we will suggest that the appearance of these zombie \nsymbols is approximately co-emergent with the West’s dawning \ncultural awareness of a worldview  crisis, and that there are sufficient \ncorrelations between the traits of the zombie and the symptomology \nof the crisis to demonstrate this linkage reliably. We will provide a \npreliminary discussion of the origins of the crisis (the full argument \nwill be reserved for forthcoming work), and argue that it is extant in \nthe personal, social, political and religious domains of life in which we \nparticipate, and which define us uniquely as a meaning-making species.\nIn the forthcoming sections, we will also argue that while the zombie is \na versatile enough symbol  to stand for many kinds of human defilement, \nthe symbol ultimately draws its aptness from being a perversion of the \nChristian  mythos of death and resurrection , and that most of its traits \nand features have emerged from, and harken back to, the matrix of the \nChristian worldview . We will contend that the zombie has evolved to \nbecome a representation of the loss of the sacred canopy  traditionally \nprovided by Christianity , and that its features have evolved along the \nfault lines of this loss, representing a world that no longer explains itself, \nnor provides us instruction for how to live within it.\nSection 2  will retrace the genealogy  of the zombie from its precursory \ninfluences and the peak popularity that began at the turn of this century. \nWe will also discuss how the zombie replaced the extra-terrestrials to \nbecome the preeminent monster for the twenty-first century, reflecting \nthe weariness and alienation left by the Cold War  and the threa t of \nnuclear apocalypse .\nSection 3  will provide the main exegesis of the zombie itself, \nseparating its myth into four predominant symbols that are recurrent \nin its popular depictions in film, television, and other literature. These \nsymbols will not simply be icons associated with the zombie’s image; \n9                It will be apparent throughout the monograph that our reference to ‘the West’ \nis invoked with predominantly American examples. As the US is the most \nsignificant exporter of popular culture in the West, our focus on American culture \nis proportionate to its contribution to the phenomenon. Though this does \nnot necessarily suggest that the phenomenon is absent from other western \ncountries, America certainly seems to be the epicenter of the crisis, and most \nexemplary of its features.\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n6 \nZombies in Western Culture\nthey will be the zombie’s physical attributes, the treatment of its name, \ncontortions of its narrative structure and the ecology of apocalypse  that \ninvariably follows it f rom one story to the next.\nSection 4  will introduce the concept of cultural domicide  (the \ndestruction of home) by exploring two chronologically distant but \nrevealing case studies examining the loss of home on a cultural scale. \nThe first of these will refer the Grassy Narrows  First Nation in Ontario, \nCanada, and the second to the decline of the Hellenistic  civilization \nfollowing the death of Alexander the Great  in 323 BCE. This section \nwill depart from discussions of the zombie to build a framework for \nworldview attunement  that will inform the discuss ions in the remaining \nsections.\nSection 5  will discuss the symptomatology of this crisis in detail \nusing the four horsemen of the Christian  apocalypse  as an analogue \nfor the four domains affected by the meaning crisis. Famine , Pestilence , \nWar and Death will stand for the personal, social, political and religious \nmanifestations of the crisis, framed by the loss of worldview  introduced \nin the previous section.\nSection 6  will offer an overview of the historical origins of the \nmeaning crisis, tracing the rise and fall of a western worldview  that \nwas composed of three constellating orders from the Aristotelean \nand Christian  paradigms. This introductory genealogy  will chronicle \nthe emergence of our cultural domicide  throughout the centuries, an \nargument that will be elaborated in forthcoming work.\nThough we will subdivide the representational corpus of the zombie \nzeitgeist into different  symbols in section 3 , and the symptoms in section \n5, we will also refer to the amalgam of zombie phenomena as a single \nsymbol  for the purpose of surveying these phenomena collectively. \nThere are two fundamental claims that we will introduce hereto and \nreiterate throughout this book. The first is that, by almost all accounts, \nzombies are the fictionally distorted, self-reflected image of modern \nhumanity. Most zombie interpretations begin with this premise, that \nin some pivotal way, “zombies are us” (see e.g., Goto-Jones 2015, \nMoreman 2010, Webb and Byrnand 2008). This book will seek to add \nvalence and depth to this proposition. Zombies do represent us, but \nmore specifically, they represent the ruin of all that is meaningful  within \nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. "
    },
    {
      "step": "Java Backend Heading Detection",
      "status": "Success",
      "duration_seconds": "1.72",
      "detected_headings_sample": [
        {
          "title": "Zombies in Western Culture",
          "pageNumber": 4,
          "level": 1
        },
        {
          "title": "Contents",
          "pageNumber": 6,
          "level": 1
        },
        {
          "title": "Authors",
          "pageNumber": 8,
          "level": 1
        },
        {
          "title": "Acknowledgements",
          "pageNumber": 9,
          "level": 1
        },
        {
          "title": "1. A New Zeitgeist",
          "pageNumber": 10,
          "level": 1
        },
        {
          "title": "2. A Transition in Metaphors:",
          "pageNumber": 18,
          "level": 1
        },
        {
          "title": "A Brief History of Monster Zeitgeists",
          "pageNumber": 18,
          "level": 1
        },
        {
          "title": "3. The Four Symbols of the",
          "pageNumber": 22,
          "level": 1
        },
        {
          "title": "Zombie Metaphor",
          "pageNumber": 22,
          "level": 1
        },
        {
          "title": "3.4 The Fourth Symbol: The Zombie Apocalypse",
          "pageNumber": 36,
          "level": 1
        },
        {
          "title": "4. A Worldview in Crisis:",
          "pageNumber": 44,
          "level": 1
        },
        {
          "title": "The Domicide of Apocalypse",
          "pageNumber": 44,
          "level": 1
        },
        {
          "title": "5. The Four Horsemen of the",
          "pageNumber": 52,
          "level": 1
        },
        {
          "title": "Zombie Apocalypse:",
          "pageNumber": 52,
          "level": 1
        },
        {
          "title": "Converging Evidence for a Crisis in",
          "pageNumber": 52,
          "level": 1
        },
        {
          "title": "5.3 Pestilence",
          "pageNumber": 68,
          "level": 1
        },
        {
          "title": "6. An Introduction to the Genealogy",
          "pageNumber": 82,
          "level": 1
        },
        {
          "title": "of the Meaning Crisis",
          "pageNumber": 82,
          "level": 1
        },
        {
          "title": "6.2 How the Meaning Was Lost: The Fall of the",
          "pageNumber": 86,
          "level": 1
        },
        {
          "title": "7. Conclusion",
          "pageNumber": 92,
          "level": 1
        },
        {
          "title": "References",
          "pageNumber": 96,
          "level": 1
        },
        {
          "title": "Index",
          "pageNumber": 100,
          "level": 1
        },
        {
          "title": "This book need not end here…",
          "pageNumber": 104,
          "level": 1
        },
        {
          "title": "You may also be interested in:",
          "pageNumber": 105,
          "level": 1
        },
        {
          "title": "Zombies in Western Culture",
          "pageNumber": 106,
          "level": 1
        },
        {
          "title": "JOHN VERVAEKE, CHRISTOPHER MASTROPIETRO AND FILIP MISCEVIC",
          "pageNumber": 106,
          "level": 1
        },
        {
          "title": "Three Orders",
          "pageNumber": 86,
          "level": 1
        },
        {
          "title": "A Twenty-First Century Crisis",
          "pageNumber": 106,
          "level": 1
        },
        {
          "title": "A Twenty-First Century Crisis",
          "pageNumber": 4,
          "level": 1
        },
        {
          "title": "4.2 Domicide of the Hellenistic Era",
          "pageNumber": 49,
          "level": 1
        },
        {
          "title": "Meaning",
          "pageNumber": 52,
          "level": 1
        },
        {
          "title": "JOHN VERVAEKE, CHRISTOPHER MASTROPIETRO",
          "pageNumber": 1,
          "level": 1
        },
        {
          "title": "AND FILIP MISCEVIC",
          "pageNumber": 1,
          "level": 1
        },
        {
          "title": "To access digital resources including:",
          "pageNumber": 2,
          "level": 1
        },
        {
          "title": "6.",
          "pageNumber": 7,
          "level": 0
        },
        {
          "title": "7.",
          "pageNumber": 7,
          "level": 0
        },
        {
          "title": "blog posts",
          "pageNumber": 2,
          "level": 1
        },
        {
          "title": "6.1",
          "pageNumber": 7,
          "level": 0
        },
        {
          "title": "6.2",
          "pageNumber": 7,
          "level": 0
        },
        {
          "title": "1.",
          "pageNumber": 6,
          "level": 0
        },
        {
          "title": "2.",
          "pageNumber": 6,
          "level": 0
        },
        {
          "title": "3.",
          "pageNumber": 6,
          "level": 0
        },
        {
          "title": "4.",
          "pageNumber": 6,
          "level": 0
        },
        {
          "title": "5.",
          "pageNumber": 6,
          "level": 0
        },
        {
          "title": "videos",
          "pageNumber": 2,
          "level": 1
        },
        {
          "title": "online appendices",
          "pageNumber": 2,
          "level": 1
        },
        {
          "title": "DOI: 10.11647/OBP.0113",
          "pageNumber": 5,
          "level": 0
        },
        {
          "title": "3.1",
          "pageNumber": 6,
          "level": 0
        },
        {
          "title": "3.2",
          "pageNumber": 6,
          "level": 0
        },
        {
          "title": "3.3",
          "pageNumber": 6,
          "level": 0
        }
      ]
    },
    {
      "step": "Gemini Metadata Extraction",
      "status": "Success",
      "duration_seconds": "6.37",
      "prompt": "The following text is from the first 15 pages of a book's PDF. Your only task is to find the name of the book, the authors, and then the Table of Contents within this text, ignoring everything else.\nAnalyze the text, extract:\n1. The book title\n2. The authors\n3. The complete chapter list with titles\nReturn the results as a single JSON object with this exact format:\n{\n  'book_title': 'Exact Book Title',\n  'authors': ['Author One', 'Author Two'],\n  'toc': [\n    {'chapter_numerical_number': 1, 'chapter_full_title': 'Chapter 1: Title'},\n    {'chapter_numerical_number': null, 'chapter_full_title': 'Preface'}\n  ]\n}\nInclude all numbered chapters as well as non-numbered sections like 'Preface', 'Introduction', 'Conclusion', etc.\nIf you cannot find a Table of Contents, return 'toc': [] but still try to provide the book title and authors if present.\nTEXT FROM FIRST 15 PAGES:\nJOHN VERVAEKE , CHRISTOPHER  MASTROPIETRO  \nAND FILIP MISCEVIC\n     A Twenty-First Century CrisisZombies in\nWestern Culture\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nTo access digital resources including:\nblog posts\nvideos\nonline appendices\nand to purchase copies of this book in:\nhardback\npaperback\nebook editions\nGo to:\nhttps://www.openbookpublishers.com/product/602\nOpen Book Publishers is a non-profit independent initiative. \nWe rely on sales and donations to continue publishing  \nhigh-quality academic works.\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nZombies in Western Culture  \nA Twenty-First Century Crisis\nJohn Vervaeke, Christopher Mastropietro,  \nand Filip Miscevic\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nhttps://www.openbookpublishers.com\n© 2017 John Vervaeke, Christopher Mastropietro and Filip Miscevic.\nThis work is licensed under a Creative Commons Attribution 4.0 International license (CC \nBY 4.0). This license allows you to share, copy, distribute and transmit the work; to adapt \nthe work and to make commercial use of the work providing attribution is made to the \nauthors (but not in any way that suggests that they endorse you or your use of the work). \nAttribution should include the following information:\nJohn Vervaeke, Christopher Mastropietro and Filip Miscevic, Zombies in Western Culture : \nA Twenty-First Century Crisis . Cambridge, UK: Open Book Publishers, 2017, http://dx.doi.\norg/10.11647/OBP.0113\nIn order to access detailed and updated information on the license, please visit https://\nwww.openbookpublishers.com/product/602#copyright\nFurther details about CC BY licenses are available at http://creativecommons.org/licenses/\nby/4.0/\nAll external links were active at the time of publication unless otherwise stated and have \nbeen archived via the Internet Archive Wayback Machine at https://archive.org/web\nDigital material and resources associated with this volume are available at https://www.\nopenbookpublishers.com/product/602#resources\nEvery effort has been made to identify and contact copyright holders and any omission or \nerror will be corrected if notification is made to the publisher.\nISBN Paperback: 9781783743285\nISBN Hardback: 9781783743292\nISBN Digital (PDF): 9781783743308\nISBN Digital ebook (epub): 9781783743315\nISBN Digital ebook (mobi): 9781783743322\nDOI: 10.11647/OBP.0113\nCover image: Zombies  (2013), by Benjamin Réthoré. CC BY 2.0, https://www.flickr.com/\nphotos/bnthor/32590607323/in/photostream/\nAll paper used by Open Book Publishers is SFI (Sustainable Forestry Initiative), PEFC \n(Programme for the Endorsement of Forest Certification Schemes) and Forest Stewardship \nCouncil(r)(FSC(r) certified.\nPrinted in the United Kingdom, United States, and Australia  \nby Lightning Source for Open Book Publishers (Cambridge, UK)\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nContents\nAuthors vii\nAcknowledgements viii\n1.A New Zeitgeist 1\n2.A Transition in Metaphors: A Brief History of Monster Zeitgeists 9\n3.The Four Symbols of the Zombie Metaphor 13\n3.1 The First Symbol: The Semiosis of the Zombie 13\n3.2 The Second Symbol: The Name of the Zombie 22\n3.3 The Third Symbol: The Failure of the Metanarrative  24\n3.4 The Fourth Symbol: The Zombie Apocalypse 27\n4.A Worldview in Crisis: The Domicide of Apocalypse 35\n4.1 Grassy Narrows 35\n4.2 Domicide of the Hellenistic Era 40\n5.The Four Horsemen of the Zombie Apocalypse: Converging \nEvidence for a Crisis in Meaning43\n5.1 Death 45\n5.2 Famine 53\n5.3 Pestilence 59\n5.4 War 62\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n6.An Introduction to the Genealogy of the Meaning Crisis 73\n6.1 The Meaning that Was Lost: Three Orders of a Worldview 73\n6.2 How the Meaning Was Lost: The Fall of the Three Orders 77\n7.Conclusion 83\nReferences 87\nIndex 91\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nAuthors\nDr. John Vervaeke  is an Assistant Professor, in the teaching stream. He \nhas been teaching at the University of Toronto since 1994. He currently \nteaches courses in the Psychology Department and the Cognitive \nScience Program. He has won and been nominated for several teaching \nawards including the 2001 Students’ Administrative Council and \nAssociation of Part-time Undergraduate Students Teaching Award for \nthe Humanities, and the 2012 Ranjini Ghosh Excellence in Teaching \nAward. He has published articles on relevance realization, general \nintelligence, mindfulness, metaphor, and wisdom. His abiding passion \nis to address the Meaning Crisis that besets western culture.\nChristopher Mastropietro  has completed a BA in semiotics, philosophy \nand political science at the University of Toronto. He has been working \nwith John Vervaeke since 2012 to formulate and publish a response to \nthe western Meaning Crisis with convergent insights from cognitive \nscience, philosophy and other disciplines. Christopher is interested in \nthe interaction between sacred symbols and wisdom, and the emergence \nof identity within interpersonal relationships.\nFilip Miscevic  is currently a Ph.D. student in the Cognitive Science \nProgram at Indiana University Bloomington, studying under Dr. Olaf \nSporns in the Computational Cognitive Neuroscience Laboratory. \nHe completed a BSc in cognitive science, neuroscience and computer \nscience at the University of Toronto in 2015, where he was a student of \nJohn Vervaeke. He is fascinated by how an understanding of the mind \nwill revolutionize not only our clinical and scientific practices, but our \nsocial and cultural ones as well―and in particular how it will come to \nbear on the Meaning Crisis discussed in this book, for which the zombie \nhas become the flag-bearer.\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \nAcknowledgements\nThe authors gratefully acknowledge the contributions of the following \npeople, whose feedback helped to focus and refine the arguments in this \nbook: Sean al-Baroudi, Sara Hansen, Scott Gardiner, Sasa Milic, Kelly \nMudie, Amogh Sahu and Anderson Todd. We also thank Alessandra \nTosi for her excellent feedback and collaboration.\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n1. A New Zeitgeist\n“Not the Black Death, this time; the Gray Life”.\nHuxley 1962: 59\nFig. 1: Prevalence of the use of the word “zombie” from 1920–2008 in \npredominantly English books published in any country.1\nFig. 2: Zombie Walk Mexico  (2011). Photo by Munir Hamdan.2\n1      From Google N-Gram Viewer ( Michel et al. 2011 ).\n2      Flickr, CC BY 2.0, https://bit.ly/2pcvULo\n© 2017 J. Vervaeke, C. Mastropietro, F. Miscevic, CC BY 4.0  https://doi.org/10.11647/OBP.0113.01\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n2 \nZombies in Western Culture\nIn 2001, a very peculiar performance art begins to take place across North \nAmerica. It occurs first in Sacramento, California and again two years \nlater in Toronto, Ontario. By 2008, it starts recurring annually in certain \nurban centers, grows steadily with each passing year, and spreads \nfrom one city to the next. Sometimes it has fewer than 50 participants. \nSometimes it has over 1000. In late 2011, Mexico City boasts a record \nof 9,000. Some gatherings are meticulous and coordinated, others are \nimpromptu. Some participants join in advance, and many decide to \nfollow spontaneously. Before long, the phenomenon begins to spread \naround the globe.\nFig. 3: “I thought that beauty alone would satisfy. But the soul is gone. \nI can’t bear those empty, staring eyes”. Screenshot from the Halperin \nbrothers ’ 1932 film, White Zombie , at 40:11.3\nIt should surprise us that these “walks” have only begun to appear, \nwhen the paradigm for their behavior has existed since the Halperin \nbrothers  produced White Zombie  in 1932. In this film, a young man \nturned voodoo master transforms a young woman into a subordinate, \npale-skinned corpse. Though his motive is initially to gain her love, his \nmagic succeeds only in removing her vitality. This ironic consequence \ncomes to effect change in his intentions, and he repents to her: “I thought \nthat beauty alone would satisfy. But the soul is gone. I can’t bear those \nempty, staring eyes”. It is a mark of how the zombie has developed over \nthe years that the word “beauty” could ever have been used to describe it.\n3                                  A remastered version of the movie is available at https://www.youtube.com/\nwatch?v=lQ0hL4EBC58\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n 3\n1. A New Zeitgeist\nThe outbreak of zombieism is a twentieth century phenomenon, but \nin the twenty-first century it explodes into zeitgeist. Over 600 zombie \nmovies have been made since 1920, but over one half of them have been \nin the last 10 years. Two great waves have lapped onto the shore of \nAmerican cinema since 2000: one around 2001, and then again in 2008.4 \nTwenty-Eight Days Later  comes out in 2002, George Romero ’s Dawn of the \nDead  is remade in 2004, and Zombieland  becomes the highest-grossing \nzombie film to date in 2009. This is quickly overtaken in 2013, first by \nWarm Bodies , and then by the Brad Pitt epic, World War Z .5 By 2015, there \nare three TV series based on zombies: Z Nation  on Netflix, iZombie  on \nCW, and AMC’s breakthrough hit, The Walking Dead .6 The genre has \nalso enjoyed considerable success in the medium of video games, most \nnotably in the highly lauded The Last of Us .7\nClearly, the zombie has transcended the constraints of its own genre. \nWhereas early zombie films closely adhered to horror tropes, more recent \nrenditions have wed themselves to comedy and romance (Zack Snyder  \nreleased the comedic Shaun of the Dead  in 2004 to critical and popular \nacclaim),8 and broken away from melodrama. The zombie has become a \npervasive cultural symbol  that is constantly expanding its reference, not \ncontent to relegate itself to its tradition. As Dele uze and G uattari (1972: \n332) put it “the only modern myth is the myth of zombies”. The zombie \nseems to be a shifting signifier with an unending hermeneutical compass. \nAnd yet its features remain remarkably consistent from one story to the \nnext, and it has represented many varieties of apocalypse  without altering \nits basic nature: consumerism, poverty, hunger, political dystopia and \n4                                                Annalee Newitz (2008), “War and Social Upheaval Cause Spikes in Zombie Movie \nProduction”, i09.com\n5                                Trailers available on YouTube: Twenty-Eight Days Later  at https://www.youtube.com/\nwatch?v=c7ynwAgQlDQ ; Dawn of the Dead  at https://www.youtube.com/watch?v=-\n-IIwV_Y6VU ; Zombieland  at https://www.youtube.com/watch?v=8m9EVP8X7N8 ; \nWarm Bodies  at https://www.youtube.com/watch?v=yvjwKqA2_9U ; World War Z  \nat https://www.youtube.com/watch?v=HcwTxRuq-uk\n6                Trailers are available on YouTube: Z Nation  at https://www.youtube.com/\nwatch?v=7ZFIS2AqAz8 ; iZombie  (Season 1) at https://www.youtube.com/\nwatch?v=UndyIFo_jZ4 ; The Walking Dead  (Season 1) at https://www.youtube.com/\nwatch?v=sfAc2U20uyg\n7                The trailer of The Last of Us  is available on YouTube at https://www.youtube.com/\nwatch?v=OQWD5W3fpPM\n8                The trailer of Shaun of the Dead  is available on YouTube at https://www.youtube.\ncom/watch?v=LIfcaZ4pC-4\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n4 \nZombies in Western Culture\nenvironmental degradation, zombies have assumed a heterogeneity of \nugliness. No longer simply a vehicle for entertainment, it has become \nthe basis for critical reflection and cultural self-examination, to which an \nincreasing number of academic publications on t he subject atte st (Goto-\nJones  2015; Moreman 2010; We bb and Byrnand 2008). For instance, \nTelevision Ontario devoted an episode of The Agenda with Steve Paikin  \nin 2011 to an unreserved examination of humanity’s most nauseating \nadversary. Four panelists―Daniel Drezner , Arnold T. Blumberg , Robert \nSmith  and Andrew Watson ―sat down to parse its menaces and flesh out \nits metaphors. Zombies have pressed us with the dangers of a unique \nmoment in time, and they have become the most enduring, expressive \nand consummate metaphor for our crisis in meaning.\nThe zombie has been subject to a vast variety of interpretations by \nculture theorists and academics. To examine these exhaustively would \nbe beyond the scope of this or any other monograph. The affinity \nbetween zombies and states of human decrepitude has permitted the \nview that zombies can stand for nearly every conceivable human failing. \nThe present authors propose that the interpretations most favoured by \nacademics―mortality, consumerism and environmental degradation \namong them―are plausible without being sufficient. The mere fact that \neach seems to apply invalidates the proposition that any one of them can \napply exclusively. We take the position that this exegetic pigeonholing \noften falls deftly into the “forest for the trees” category of thinking. The \nzombie zeitgeist accommodates interpretations of disquiet about many \ntopics, yet we will argue that each of these readings should be understood \nas elements of a broader symptomatology. This symptomatology, we \nwill explain, relates to a condition that is far more complex than has \nbeen supposed by any theorist that has previously written on this topic.\nWe propose that the cultural phenomenon of the zombie has provided \nus with a constellation of four intersecting symbols for a modern \nhuman ethos, and that these symbols represent a crisis of worldview  \nthat has no precedent in modern western civilization. Our use of the \ncollective pronoun “we” shall be in broad reference to North-American \nand Western culture more generally. This limitation notwithstanding, \nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n 5\n1. A New Zeitgeist\nthe authors will make no claims regarding the applicability of these \narguments to cultures that may fall outside of that moniker.9\nIn this book we will suggest that the appearance of these zombie \nsymbols is approximately co-emergent with the West’s dawning \ncultural awareness of a worldview  crisis, and that there are sufficient \ncorrelations between the traits of the zombie and the symptomology \nof the crisis to demonstrate this linkage reliably. We will provide a \npreliminary discussion of the origins of the crisis (the full argument \nwill be reserved for forthcoming work), and argue that it is extant in \nthe personal, social, political and religious domains of life in which we \nparticipate, and which define us uniquely as a meaning-making species.\nIn the forthcoming sections, we will also argue that while the zombie is \na versatile enough symbol  to stand for many kinds of human defilement, \nthe symbol ultimately draws its aptness from being a perversion of the \nChristian  mythos of death and resurrection , and that most of its traits \nand features have emerged from, and harken back to, the matrix of the \nChristian worldview . We will contend that the zombie has evolved to \nbecome a representation of the loss of the sacred canopy  traditionally \nprovided by Christianity , and that its features have evolved along the \nfault lines of this loss, representing a world that no longer explains itself, \nnor provides us instruction for how to live within it.\nSection 2  will retrace the genealogy  of the zombie from its precursory \ninfluences and the peak popularity that began at the turn of this century. \nWe will also discuss how the zombie replaced the extra-terrestrials to \nbecome the preeminent monster for the twenty-first century, reflecting \nthe weariness and alienation left by the Cold War  and the threa t of \nnuclear apocalypse .\nSection 3  will provide the main exegesis of the zombie itself, \nseparating its myth into four predominant symbols that are recurrent \nin its popular depictions in film, television, and other literature. These \nsymbols will not simply be icons associated with the zombie’s image; \n9                It will be apparent throughout the monograph that our reference to ‘the West’ \nis invoked with predominantly American examples. As the US is the most \nsignificant exporter of popular culture in the West, our focus on American culture \nis proportionate to its contribution to the phenomenon. Though this does \nnot necessarily suggest that the phenomenon is absent from other western \ncountries, America certainly seems to be the epicenter of the crisis, and most \nexemplary of its features.\nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. \n6 \nZombies in Western Culture\nthey will be the zombie’s physical attributes, the treatment of its name, \ncontortions of its narrative structure and the ecology of apocalypse  that \ninvariably follows it f rom one story to the next.\nSection 4  will introduce the concept of cultural domicide  (the \ndestruction of home) by exploring two chronologically distant but \nrevealing case studies examining the loss of home on a cultural scale. \nThe first of these will refer the Grassy Narrows  First Nation in Ontario, \nCanada, and the second to the decline of the Hellenistic  civilization \nfollowing the death of Alexander the Great  in 323 BCE. This section \nwill depart from discussions of the zombie to build a framework for \nworldview attunement  that will inform the discuss ions in the remaining \nsections.\nSection 5  will discuss the symptomatology of this crisis in detail \nusing the four horsemen of the Christian  apocalypse  as an analogue \nfor the four domains affected by the meaning crisis. Famine , Pestilence , \nWar and Death will stand for the personal, social, political and religious \nmanifestations of the crisis, framed by the loss of worldview  introduced \nin the previous section.\nSection 6  will offer an overview of the historical origins of the \nmeaning crisis, tracing the rise and fall of a western worldview  that \nwas composed of three constellating orders from the Aristotelean \nand Christian  paradigms. This introductory genealogy  will chronicle \nthe emergence of our cultural domicide  throughout the centuries, an \nargument that will be elaborated in forthcoming work.\nThough we will subdivide the representational corpus of the zombie \nzeitgeist into different  symbols in section 3 , and the symptoms in section \n5, we will also refer to the amalgam of zombie phenomena as a single \nsymbol  for the purpose of surveying these phenomena collectively. \nThere are two fundamental claims that we will introduce hereto and \nreiterate throughout this book. The first is that, by almost all accounts, \nzombies are the fictionally distorted, self-reflected image of modern \nhumanity. Most zombie interpretations begin with this premise, that \nin some pivotal way, “zombies are us” (see e.g., Goto-Jones 2015, \nMoreman 2010, Webb and Byrnand 2008). This book will seek to add \nvalence and depth to this proposition. Zombies do represent us, but \nmore specifically, they represent the ruin of all that is meaningful  within \nZombies in Western Culture : A Twenty-First Century Crisis, Open Book Publishers, 2017. ProQuest Ebook Central,\nCopyright © 2017. Open Book Publishers. All rights reserved. ",
      "result": {
        "error": "Failed to parse JSON",
        "raw_text": "```json\n{\n  \"book_title\": \"Zombies in Western Culture: A Twenty-First Century Crisis\",\n  \"authors\": [\"John Vervaeke\", \"Christopher Mastropietro\", \"Filip Miscevic\"],\n  \"toc\": [\n    {\"chapter_numerical_number\": null, \"chapter_full_title\": \"Authors\"},\n    {\"chapter_numerical_number\": null, \"chapter_full_title\": \"Acknowledgements\"},\n    {\"chapter_numerical_number\": 1, \"chapter_full_title\": \"A New Zeitgeist\"},\n    {\"chapter_numerical_number\": 2, \"chapter_full_title\": \"A Transition in Metaphors: A Brief History of Monster Zeitgeists\"},\n    {\"chapter_numerical_number\": 3, \"chapter_full_title\": \"The Four Symbols of the Zombie Metaphor\"},\n    {\"chapter_numerical_number\": 3.1, \"chapter_full_title\": \"The First Symbol: The Semiosis of the Zombie\"},\n    {\"chapter_numerical_number\": 3.2, \"chapter_full_title\": \"The Second Symbol: The Name of the Zombie\"},\n    {\"chapter_numerical_number\": 3.3, \"chapter_full_title\": \"The Third Symbol: The Failure of the Metanarrative\"},\n    {\"chapter_numerical_number\": 3.4, \"chapter_full_title\": \"The Fourth Symbol: The Zombie Apocalypse\"},\n    {\"chapter_numerical_number\": 4, \"chapter_full_title\": \"A Worldview in Crisis: The Domicide of Apocalypse\"},\n    {\"chapter_numerical_number\": 4.1, \"chapter_full_title\": \"Grassy Narrows\"},\n    {\"chapter_numerical_number\": 4.2, \"chapter_full_title\": \"Domicide of the Hellenistic Era\"},\n    {\"chapter_numerical_number\": 5, \"chapter_full_title\": \"The Four Horsemen of the Zombie Apocalypse: Converging Evidence for a Crisis in Meaning\"},\n    {\"chapter_numerical_number\": 5.1, \"chapter_full_title\": \"Death\"},\n    {\"chapter_numerical_number\": 5.2, \"chapter_full_title\": \"Famine\"},\n    {\"chapter_numerical_number\": 5.3, \"chapter_full_title\": \"Pestilence\"},\n    {\"chapter_numerical_number\": 5.4, \"chapter_full_title\": \"War\"},\n    {\"chapter_numerical_number\": 6, \"chapter_full_title\": \"An Introduction to the Genealogy of the Meaning Crisis\"},\n    {\"chapter_numerical_number\": 6.1, \"chapter_full_title\": \"The Meaning that Was Lost: Three Orders of a Worldview\"},\n    {\"chapter_numerical_number\": 6.2, \"chapter_full_title\": \"How the Meaning Was Lost: The Fall of the Three Orders\"},\n    {\"chapter_numerical_number\": 7, \"chapter_full_title\": \"Conclusion\"},\n    {\"chapter_numerical_number\": null, \"chapter_full_title\": \"References\"},\n    {\"chapter_numerical_number\": null, \"chapter_full_title\": \"Index\"}\n  ]\n}\n```"
      }
    },
    {
      "step": "Gemini Chapter Matching",
      "status": "Success",
      "duration_seconds": "3.15",
      "prompt": "EXPECTED CHAPTERS from Table of Contents for \"\":\n[]\n\nPDF HEADINGS FOUND:\n[\n  {\n    \"title\": \"Zombies in Western Culture\",\n    \"pageNumber\": 4,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Contents\",\n    \"pageNumber\": 6,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Authors\",\n    \"pageNumber\": 8,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Acknowledgements\",\n    \"pageNumber\": 9,\n    \"level\": 1\n  },\n  {\n    \"title\": \"1. A New Zeitgeist\",\n    \"pageNumber\": 10,\n    \"level\": 1\n  },\n  {\n    \"title\": \"2. A Transition in Metaphors:\",\n    \"pageNumber\": 18,\n    \"level\": 1\n  },\n  {\n    \"title\": \"A Brief History of Monster Zeitgeists\",\n    \"pageNumber\": 18,\n    \"level\": 1\n  },\n  {\n    \"title\": \"3. The Four Symbols of the\",\n    \"pageNumber\": 22,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Zombie Metaphor\",\n    \"pageNumber\": 22,\n    \"level\": 1\n  },\n  {\n    \"title\": \"3.4 The Fourth Symbol: The Zombie Apocalypse\",\n    \"pageNumber\": 36,\n    \"level\": 1\n  },\n  {\n    \"title\": \"4. A Worldview in Crisis:\",\n    \"pageNumber\": 44,\n    \"level\": 1\n  },\n  {\n    \"title\": \"The Domicide of Apocalypse\",\n    \"pageNumber\": 44,\n    \"level\": 1\n  },\n  {\n    \"title\": \"5. The Four Horsemen of the\",\n    \"pageNumber\": 52,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Zombie Apocalypse:\",\n    \"pageNumber\": 52,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Converging Evidence for a Crisis in\",\n    \"pageNumber\": 52,\n    \"level\": 1\n  },\n  {\n    \"title\": \"5.3 Pestilence\",\n    \"pageNumber\": 68,\n    \"level\": 1\n  },\n  {\n    \"title\": \"6. An Introduction to the Genealogy\",\n    \"pageNumber\": 82,\n    \"level\": 1\n  },\n  {\n    \"title\": \"of the Meaning Crisis\",\n    \"pageNumber\": 82,\n    \"level\": 1\n  },\n  {\n    \"title\": \"6.2 How the Meaning Was Lost: The Fall of the\",\n    \"pageNumber\": 86,\n    \"level\": 1\n  },\n  {\n    \"title\": \"7. Conclusion\",\n    \"pageNumber\": 92,\n    \"level\": 1\n  },\n  {\n    \"title\": \"References\",\n    \"pageNumber\": 96,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Index\",\n    \"pageNumber\": 100,\n    \"level\": 1\n  },\n  {\n    \"title\": \"This book need not end here\\u2026\",\n    \"pageNumber\": 104,\n    \"level\": 1\n  },\n  {\n    \"title\": \"You may also be interested in:\",\n    \"pageNumber\": 105,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Zombies in Western Culture\",\n    \"pageNumber\": 106,\n    \"level\": 1\n  },\n  {\n    \"title\": \"JOHN VERVAEKE, CHRISTOPHER MASTROPIETRO AND FILIP MISCEVIC\",\n    \"pageNumber\": 106,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Three Orders\",\n    \"pageNumber\": 86,\n    \"level\": 1\n  },\n  {\n    \"title\": \"A Twenty-First Century Crisis\",\n    \"pageNumber\": 106,\n    \"level\": 1\n  },\n  {\n    \"title\": \"A Twenty-First Century Crisis\",\n    \"pageNumber\": 4,\n    \"level\": 1\n  },\n  {\n    \"title\": \"4.2 Domicide of the Hellenistic Era\",\n    \"pageNumber\": 49,\n    \"level\": 1\n  },\n  {\n    \"title\": \"Meaning\",\n    \"pageNumber\": 52,\n    \"level\": 1\n  },\n  {\n    \"title\": \"JOHN VERVAEKE, CHRISTOPHER MASTROPIETRO\",\n    \"pageNumber\": 1,\n    \"level\": 1\n  },\n  {\n    \"title\": \"AND FILIP MISCEVIC\",\n    \"pageNumber\": 1,\n    \"level\": 1\n  },\n  {\n    \"title\": \"To access digital resources including:\",\n    \"pageNumber\": 2,\n    \"level\": 1\n  },\n  {\n    \"title\": \"6.\",\n    \"pageNumber\": 7,\n    \"level\": 0\n  },\n  {\n    \"title\": \"7.\",\n    \"pageNumber\": 7,\n    \"level\": 0\n  },\n  {\n    \"title\": \"blog posts\",\n    \"pageNumber\": 2,\n    \"level\": 1\n  },\n  {\n    \"title\": \"6.1\",\n    \"pageNumber\": 7,\n    \"level\": 0\n  },\n  {\n    \"title\": \"6.2\",\n    \"pageNumber\": 7,\n    \"level\": 0\n  },\n  {\n    \"title\": \"1.\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"2.\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"3.\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"4.\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"5.\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"videos\",\n    \"pageNumber\": 2,\n    \"level\": 1\n  },\n  {\n    \"title\": \"online appendices\",\n    \"pageNumber\": 2,\n    \"level\": 1\n  },\n  {\n    \"title\": \"DOI: 10.11647/OBP.0113\",\n    \"pageNumber\": 5,\n    \"level\": 0\n  },\n  {\n    \"title\": \"3.1\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"3.2\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"3.3\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"3.4\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"4.1\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"4.2\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"5.1\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"5.2\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"5.3\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"5.4\",\n    \"pageNumber\": 6,\n    \"level\": 0\n  },\n  {\n    \"title\": \"6736(12)61910-2\",\n    \"pageNumber\": 98,\n    \"level\": 0\n  },\n  {\n    \"title\": \"6736(13)60572-3\",\n    \"pageNumber\": 99,\n    \"level\": 0\n  },\n  {\n    \"title\": \"94-007-7987-7_2\",\n    \"pageNumber\": 99,\n    \"level\": 0\n  },\n  {\n    \"title\": \"81, 83, 85\",\n    \"pageNumber\": 100,\n    \"level\": 0\n  },\n  {\n    \"title\": \"66, 67, 73, 86\",\n    \"pageNumber\": 100,\n    \"level\": 0\n  },\n  {\n    \"title\": \"73, 85, 86\",\n    \"pageNumber\": 100,\n    \"level\": 0\n  },\n  {\n    \"title\": \"70, 76, 80, 84, 85\",\n    \"pageNumber\": 101,\n    \"level\": 0\n  },\n  {\n    \"title\": \"65, 76, 78\",\n    \"pageNumber\": 101,\n    \"level\": 0\n  },\n  {\n    \"title\": \"64, 66, 85, 86\",\n    \"pageNumber\": 101,\n    \"level\": 0\n  },\n  {\n    \"title\": \"75, 80\",\n    \"pageNumber\": 101,\n    \"level\": 0\n  },\n  {\n    \"title\": \"27, 30\",\n    \"pageNumber\": 101,\n    \"level\": 0\n  },\n  {\n    \"title\": \"84, 85, 86\",\n    \"pageNumber\": 102,\n    \"level\": 0\n  },\n  {\n    \"title\": \"49, 63, 84, 85\",\n    \"pageNumber\": 102,\n    \"level\": 0\n  }\n]\n\nTask: For each expected chapter, find the best matching PDF heading and return the complete list with page numbers.\nReturn ALL expected chapters in this exact JSON format:\n[\n  {'chapter_numerical_number': 1, 'chapter_full_title': 'Chapter 1: Exact Title', 'page_start': 25},\n  {'chapter_numerical_number': null, 'chapter_full_title': 'Introduction', 'page_start': 5}\n]\nRules:\n- Include ALL chapters from the expected list\n- Use exact titles from expected chapters\n- Find page numbers from PDF headings by matching similar titles\n- If no page found, use 0 as page_start\n- Return complete JSON array with all chapters",
      "result": {
        "error": "Failed to parse JSON",
        "raw_text": "```json\n[\n  {\"chapter_numerical_number\": 1, \"chapter_full_title\": \"A New Zeitgeist\", \"page_start\": 10},\n  {\"chapter_numerical_number\": 2, \"chapter_full_title\": \"A Transition in Metaphors: A Brief History of Monster Zeitgeists\", \"page_start\": 18},\n  {\"chapter_numerical_number\": 3, \"chapter_full_title\": \"The Four Symbols of the Zombie Metaphor\", \"page_start\": 22},\n  {\"chapter_numerical_number\": 4, \"chapter_full_title\": \"A Worldview in Crisis: The Domicide of Apocalypse\", \"page_start\": 44},\n  {\"chapter_numerical_number\": 5, \"chapter_full_title\": \"The Four Horsemen of the Zombie Apocalypse: Converging Evidence for a Crisis in Meaning\", \"page_start\": 52},\n  {\"chapter_numerical_number\": 6, \"chapter_full_title\": \"An Introduction to the Genealogy of the Meaning Crisis\", \"page_start\": 82},\n  {\"chapter_numerical_number\": 7, \"chapter_full_title\": \"Conclusion\", \"page_start\": 92}\n]\n```"
      }
    }
  ],
  "final_result": {
    "book_title": "Title Not Found",
    "authors": [],
    "toc": []
  },
  "total_workflow_seconds": "11.35"
}